mariopartyrd/marioparty4/src/REL/m456Dll/main.c
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hu3d.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/wipe.h"
#include "string.h"

#include "REL/m456Dll.h"
#include "version.h"

#ifndef __MWERKS__
#include "game/esprite.h"
#include "game/frand.h"
#endif

typedef struct M456DllMainWork {
    struct {
        u8 unk_00_field0 : 1;
        u8 unk_00_field1 : 1;
        u8 unk_00_field2 : 1;
        u8 unk_00_field3 : 1;
    };
    s16 unk_02;
    s16 unk_04;
    s8 unk_06;
    s8 unk_07;
    u16 unk_08;
    u16 unk_0A;
    s32 unk_0C;
    s32 unk_10;
    s16 unk_14;
    s16 unk_16;
    s16 unk_18;
    s16 unk_1A;
    char unk1C[4];
    s32 unk_20;
    s32 unk_24;
    s16 unk_28;
    s16 unk_2A;
    s16 unk_2C;
    s16 unk_2E;
    s16 unk_30;
} M456DllMainWork; /* size = 0x34 */

typedef struct M456DllData0Struct {
    /* 0x00 */ float unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
} M456DllData0Struct; /* size = 0x1C */

typedef struct M456DllData1B0Struct {
    /* 0x00 */ u32 unk_00;
    /* 0x04 */ s32 unk_04;
} M456DllData1B0Struct; /* size = 0x08 */

typedef struct M456DllDataE4Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ u32 unk_04;
} M456DllDataE4Struct; /* size = 0x08 */

typedef struct M456DllBss18Struct {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    float unk_0C;
    float unk_10;
    s32 unk_14;
    s32 unk_18;
    float unk_1C;
    s16 unk_20[0x10];
} M456DllBss18Struct; /* size 0x40 */

void fn_1_1304(OMOBJ *object);
void fn_1_2040(OMOBJ *object);
float fn_1_2090(float arg8, float arg9, float argA);
void fn_1_2194(HUPROCESS *process);
void fn_1_21F8(s32 arg0, s32 arg1, float arg8);
void fn_1_2448(OMOBJ *object);
void fn_1_2918(HUPROCESS *process);
void fn_1_2AC4(OMOBJ *object);
void fn_1_3C0(OMOBJ *object);
void fn_1_498(OMOBJ *);
void fn_1_BE4(OMOBJ *);
void fn_1_C40(HUPROCESS *process);
void fn_1_CC4(void);
s32 fn_1_D2C(void);
s32 fn_1_F4C(void);
void fn_1_FD0(OMOBJ *object);

M456DllData0Struct lbl_1_data_0[2] = {
    { 500.0f, 0.0f, 1000.0f, 0.0f, 40.0f, 0.0f, 0.0f },
    { 1985.0f, 0.0f, 100.0f, 100.0f, -13.0f, 0.0f, 0.0f },
};
Vec lbl_1_data_38 = { 700.0f, 2500.0f, -700.0f };
Vec lbl_1_data_44 = { 0.0f, 0.0f, 0.0f };
GXColor lbl_1_data_50 = { 0xFF, 0xFF, 0xFF, 0xFF };
Vec lbl_1_data_54 = { 200.0f, 15000.0f, -200.0f };
Vec lbl_1_data_60 = { 0.0f, 1.0f, 0.0f };

OMOBJ *lbl_1_bss_8C;
OMOBJ *lbl_1_bss_88;
OMOBJ *lbl_1_bss_84;
s32 lbl_1_bss_80;
s32 lbl_1_bss_70[4];
s32 lbl_1_bss_6C;
s32 lbl_1_bss_68;
s32 lbl_1_bss_64;
s16 lbl_1_bss_62;
s16 lbl_1_bss_60;
u32 lbl_1_bss_5C;
u32 lbl_1_bss_58;
M456DllBss18Struct lbl_1_bss_18;
u32 lbl_1_bss_14;
Vec lbl_1_bss_8;
s16 lbl_1_bss_6;
s16 lbl_1_bss_4;
s32 lbl_1_bss_0;

void ObjectSetup(void)
{
    HUPROCESS *var_r31;
    HU3DCAMERA *var_r30;
    s16 var_r29;

    var_r30 = Hu3DCamera;
    OSReport("******* M456ObjectSetup *********\n");
    var_r31 = omInitObjMan(0x32, 0x2000);
    omGameSysInit(var_r31);
    Hu3DCameraCreate(1);
    Hu3DCameraPerspectiveSet(1, -1.0f, 20.0f, 25000.0f, 1.2f);
    Hu3DCameraViewportSet(1, 0.0f, 0.0f, 640.0f, 480.0f, 0.0f, 1.0f);
    lbl_1_bss_88 = omAddObjEx(var_r31, 0x7FDA, 0, 0, -1, omOutView);
    lbl_1_bss_8.x = lbl_1_data_44.x - lbl_1_data_38.x;
    lbl_1_bss_8.y = lbl_1_data_44.y - lbl_1_data_38.y;
    lbl_1_bss_8.z = lbl_1_data_44.z - lbl_1_data_38.z;
    VECNormalize(&lbl_1_bss_8, &lbl_1_bss_8);
    var_r29 = Hu3DGLightCreateV(&lbl_1_data_38, &lbl_1_bss_8, &lbl_1_data_50);
    Hu3DGLightInfinitytSet(var_r29);
    Hu3DGLightStaticSet(var_r29, 1);
    Hu3DShadowCreate(10.0f, var_r30->near, var_r30->far);
    Hu3DShadowTPLvlSet(0.7f);
    Hu3DShadowPosSet(&lbl_1_data_54, &lbl_1_data_60, &lbl_1_data_44);
    HuAudSndGrpSet(0x4E);
    lbl_1_bss_84 = omAddObjEx(var_r31, 0, 0, 0, -1, fn_1_3C0);
    fn_1_2194(var_r31);
    fn_1_C40(var_r31);
    fn_1_2DF4(var_r31);
    lbl_1_bss_5C = GWMGRecordGet(0xA);
    if (lbl_1_bss_5C == 0) {
        lbl_1_bss_5C = 5 * REFRESH_RATE;
    }
    lbl_1_bss_58 = 0;
    fn_1_2918(var_r31);
    lbl_1_bss_18.unk_14 = lbl_1_bss_5C;
    lbl_1_bss_18.unk_00 = 1;
    lbl_1_bss_18.unk_0C = 536.0f;
}

s32 lbl_1_data_90 = -1;
s32 lbl_1_data_94 = -1;

void fn_1_3A0(u32 arg0)
{
    lbl_1_bss_80 = arg0;
}

s32 fn_1_3B0(void)
{
    return lbl_1_bss_80;
}

void fn_1_3C0(OMOBJ *object)
{
    HU3DCAMERA *var_r31 = Hu3DCamera;
    fn_1_3A0(0);
    lbl_1_bss_6C = REFRESH_RATE;
    lbl_1_bss_70[0] = lbl_1_bss_70[1] = lbl_1_bss_70[2] = lbl_1_bss_70[3] = -1;
    lbl_1_bss_62 = 5;
    lbl_1_bss_60 = REFRESH_RATE;
    WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, 0x3C);
    var_r31->fov = 30.0f;
    object->objFunc = fn_1_498;
}

void fn_1_498(OMOBJ *object)
{
    s16 sp8[4];

    s32 var_r31;
    OMOBJ **var_r29;
    M456DllMainWork *var_r28;

    switch (fn_1_3B0()) {
        case 0:
            if (lbl_1_data_94 < 0) {
                lbl_1_data_94 = HuAudFXPlay(0x7D1);
            }
            if (--lbl_1_bss_6C == 0) {
                fn_1_3A0(1);
                lbl_1_bss_6C = 2 * REFRESH_RATE;
            }
            break;
        case 1:
            if (--lbl_1_bss_6C == 0) {
                fn_1_3A0(2);
                lbl_1_bss_6 = MGSeqCreate(3, 0);
            }
            break;
        case 2:
            if (MGSeqStatGet(lbl_1_bss_6) == 0) {
                fn_1_3A0(3);
                lbl_1_bss_4 = MGSeqCreate(1, 5, -1, -1);
            }
            if ((lbl_1_data_90 < 0) && ((MGSeqStatGet(lbl_1_bss_6) & 0x10) != 0)) {
                lbl_1_data_90 = HuAudSeqPlay(0x43);
            }
            break;
        case 3:
            if (--lbl_1_bss_60 == 0) {
                lbl_1_bss_62--;
                MGSeqParamSet(lbl_1_bss_4, 1, lbl_1_bss_62);
                lbl_1_bss_60 = REFRESH_RATE;
            }
            if (lbl_1_bss_62 == 0) {
                lbl_1_bss_64 = fn_1_D2C();
                if (lbl_1_bss_64 == 0) {
                    fn_1_3A0(5);
                    lbl_1_bss_6 = MGSeqCreate(3, 1);
                    HuAudSeqFadeOut(lbl_1_data_90, 0x64);
                }
                else {
                    fn_1_3A0(4);
                    HuAudFXPlay(0x11);
                    lbl_1_bss_6C = 2 * REFRESH_RATE;
                }
            }
            break;
        case 4:
            if (lbl_1_bss_4 >= 0) {
                MGSeqParamSet(lbl_1_bss_4, 2, -1);
                lbl_1_bss_4 = -1;
            }
            if (lbl_1_bss_6C != 0) {
                lbl_1_bss_6C--;
            }
            else if (lbl_1_bss_18.unk_18 < lbl_1_bss_14) {
                lbl_1_bss_18.unk_18++;
            }
            if (fn_1_F4C() != 0) {
                fn_1_3A0(5);
                lbl_1_bss_6 = MGSeqCreate(3, 1);
                HuAudSeqFadeOut(lbl_1_data_90, 0x64);
            }
            break;
        case 5:
            if (lbl_1_bss_4 >= 0) {
                MGSeqParamSet(lbl_1_bss_4, 2, -1);
                lbl_1_bss_4 = -1;
            }
            if (MGSeqStatGet(lbl_1_bss_6) == 0) {
                if (lbl_1_bss_58 == 0) {
                    fn_1_3A0(9);
                    lbl_1_bss_6C = 2 * REFRESH_RATE;
                }
                else {
                    fn_1_3A0(6);
                    lbl_1_bss_6 = MGSeqCreate(0xE, lbl_1_bss_58);
                    GWMGRecordSet(0xA, lbl_1_bss_58);
                    lbl_1_bss_18.unk_04 = 1;
                    lbl_1_bss_18.unk_14 = lbl_1_bss_18.unk_18;
                }
            }
            break;
        case 6:
            if (MGSeqStatGet(lbl_1_bss_6) == 0) {
                fn_1_3A0(9);
                lbl_1_bss_6C = 2 * REFRESH_RATE;
            }
            break;
        case 9:
            if (lbl_1_bss_6C != 0) {
                lbl_1_bss_6C--;
            }
            if (lbl_1_bss_6C == 0) {
                if (fn_1_F4C() != 0) {
                    fn_1_3A0(0xB);
                    if (lbl_1_bss_64 != 0) {
                        var_r29 = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
                        for (var_r31 = 0; var_r31 < lbl_1_bss_64; var_r31++) {
                            var_r28 = var_r29[lbl_1_bss_70[var_r31]]->data;
                            sp8[var_r31] = var_r28->unk_14;
                            GWPlayerCoinWinSet(lbl_1_bss_70[var_r31], 10);
                        }
                        for (; var_r31 < 4; var_r31++) {
                            sp8[var_r31] = -1;
                        }
                        lbl_1_bss_6 = MGSeqCreate(5, 3, sp8[0], sp8[1], sp8[2], sp8[3]);
                        HuAudSStreamPlay(1);
                    }
                    else {
                        lbl_1_bss_6 = MGSeqCreate(3, 2);
                        HuAudSStreamPlay(4);
                    }
                    lbl_1_bss_6C = 3.5 * REFRESH_RATE;
                }
            }
            break;
        case 11:
            if (--lbl_1_bss_6C == 0) {
                WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 0x3C);
                HuAudFXStop(lbl_1_data_94);
                object->objFunc = fn_1_BE4;
            }
            break;
    }
    if ((omSysExitReq != 0) && (WipeStatGet() == 0)) {
        WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 0x3C);
        object->objFunc = fn_1_BE4;
    }
}

