mariopartyrd/marioparty4/src/REL/m456Dll/main.c
void fn_1_BE4(OMOBJ *object)
{
    if (WipeStatGet() == 0) {
        fn_1_CC4();
        fn_1_2F3C();
        MGSeqKillAll();
        HuAudFadeOut(1);
        omOvlReturnEx(1, 1);
        OSReport("******* M456Exit *********\n");
    }
}

void fn_1_C40(HUPROCESS *process)
{
    s32 var_r31;

    lbl_1_bss_68 = 0;
    omMakeGroupEx(process, 0, 4);
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        omAddObjEx(process, 5, 0xA, 0x32, 0, fn_1_FD0);
    }
}

void fn_1_CC4(void)
{
    s32 var_r31;
    OMOBJ **var_r30;

    var_r30 = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
    if (var_r30 != NULL) {
        for (var_r31 = 0; var_r31 < 4; var_r31++) {
            fn_1_2040(var_r30[var_r31]);
        }
    }
}

s32 fn_1_D2C(void)
{
    s32 sp8[4];

    s32 var_r31;
    M456DllMainWork *var_r30;
    s32 var_r29;
    u32 var_r28;
    OMOBJ **var_r27;

    var_r29 = 0;
    var_r28 = 0;
    var_r27 = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        var_r30 = var_r27[var_r31]->data;
        if ((var_r30->unk_30 != 0) && (var_r30->unk_30 < 5)) {
            var_r30->unk_30 = 5;
        }
        if (var_r30->unk_30 > var_r28) {
            var_r28 = var_r30->unk_30;
            var_r29 = 0;
            sp8[var_r29++] = var_r31;
        }
        else if (var_r30->unk_30 == var_r28) {
            sp8[var_r29++] = var_r31;
        }
    }
    if (var_r28 == 0) {
        lbl_1_bss_70[var_r31] = -1;
        return 0;
    }
    lbl_1_bss_14 = (var_r28 * REFRESH_RATE) / 5;
    for (var_r31 = 0; var_r31 < var_r29; var_r31++) {
        if (GWPlayerCfg[sp8[var_r31]].iscom == 0) {
            break;
        }
    }
    if (var_r31 < var_r29) {
        if (lbl_1_bss_14 > lbl_1_bss_5C) {
            lbl_1_bss_58 = lbl_1_bss_14;
        }
        if (lbl_1_bss_14 >= 7.5f * REFRESH_RATE) {
            GWGameStat.present[0x33] = 1;
        }
    }
    for (var_r31 = 0; var_r31 < var_r29; var_r31++) {
        lbl_1_bss_70[var_r31] = sp8[var_r31];
    }
    return var_r29;
}

s32 fn_1_F4C(void)
{
    s32 var_r31;
    OMOBJ **var_r30;
    M456DllMainWork *var_r29;

    var_r30 = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        var_r29 = var_r30[var_r31]->data;
        if (var_r29->unk_00_field2 == 0) {
            return 0;
        }
    }
    return 1;
}

M456DllDataE4Struct lbl_1_data_E4[0xA] = {
    { DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x00), 0 },
    { DATA_MAKE_NUM(DATADIR_M456, 0x1C), 1 },
    { DATA_MAKE_NUM(DATADIR_M456, 0x24), 1 },
    { DATA_MAKE_NUM(DATADIR_M456, 0x2C), 1 },
    { DATA_MAKE_NUM(DATADIR_M456, 0x34), 1 },
    { DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x2A), 0 },
    { DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x05), 0 },
    { DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x17), 0 },
    { DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x18), 0 },
    { DATA_MAKE_NUM(DATADIR_M456, 0x3C), 1 },
};
Vec lbl_1_data_134[4] = {
    { -300.0f, 0.0f, 0.0f },
    { -100.0f, 0.0f, 0.0f },
    { 100.0f, 0.0f, 0.0f },
    { 300.0f, 0.0f, 0.0f },
};
float lbl_1_data_164[8] = { -50.0f, -50.0f, -50.0f, -50.0f, -50.0f, -50.0f, -50.0f, -50.0f };
u16 lbl_1_data_184[2] = { 0x40, 0x20 };

void fn_1_FD0(OMOBJ *object)
{
    M456DllMainWork *var_r31;
    u32 var_r29;
    s32 var_r28;
    s32 var_r27;

    var_r31 = HuMemDirectMallocNum(HEAP_HEAP, sizeof(M456DllMainWork), HU_MEMNUM_OVL);
    object->data = var_r31;
    memset(var_r31, 0, sizeof(M456DllMainWork));
    var_r31->unk_02 = lbl_1_bss_68++;
    var_r31->unk_04 = GWPlayerCfg[var_r31->unk_02].pad_idx;
    var_r27 = GWGameStat.rumble;
    var_r31->unk_10 = var_r27;
    var_r28 = GWPlayerCfg[var_r31->unk_02].character;
    var_r31->unk_14 = var_r28;
    var_r31->unk_16 = GWPlayerCfg[var_r31->unk_02].diff;
    var_r31->unk_18 = GWPlayerCfg[var_r31->unk_02].group;
    var_r31->unk_0C = -1;
    object->mdlId[0] = CharModelCreate(var_r28, 8);
    Hu3DModelShadowSet(object->mdlId[0]);
    Hu3DModelLayerSet(object->mdlId[0], 3);
    Hu3DModelCameraSet(object->mdlId[0], 1);
    var_r31->unk_20 = 0;
    for (var_r29 = 0; var_r29 < 0xA; var_r29++) {
        if (lbl_1_data_E4[var_r29].unk_04 == 0) {
            object->mtnId[var_r29] = CharMotionCreate(var_r31->unk_14, lbl_1_data_E4[var_r29].unk_00);
        }
        else {
            object->mtnId[var_r29] = CharMotionCreate(var_r31->unk_14, var_r31->unk_14 + lbl_1_data_E4[var_r29].unk_00);
        }
    }
    Hu3DMotionSet(object->mdlId[0], object->mtnId[var_r31->unk_20]);
    Hu3DModelAttrSet(object->mdlId[0], HU3D_MOTATTR_LOOP);
    CharMotionVoiceOnSet(var_r31->unk_14, object->mtnId[5], 0);
    CharMotionVoiceOnSet(var_r31->unk_14, object->mtnId[6], 0);
    var_r31->unk_2E = REFRESH_RATE;
    object->trans.x = lbl_1_data_134[var_r31->unk_02].x;
    object->trans.y = lbl_1_data_134[var_r31->unk_02].y;
    object->trans.z = lbl_1_data_134[var_r31->unk_02].z;
    object->rot.y = 0.0f;
    CharModelDataClose(var_r31->unk_14);
    object->objFunc = fn_1_1304;
}

#if VERSION_PAL
#define fn_1_1288_COND (((var_r31->unk_16 + 4) * 60) / 50.0f)
#else
#define fn_1_1288_COND (var_r31->unk_16 + 4)
#endif

void fn_1_1288(OMOBJ *object)
{
    M456DllMainWork *var_r31 = object->data;

    if ((frand() & 0x3F) < fn_1_1288_COND) {
        if (var_r31->unk_0C <= 0) {
            var_r31->unk_0A |= 0x40;
            return;
        }
        var_r31->unk_0A |= 0x20;
    }
}

void fn_1_1304(OMOBJ *var_r30)
{
    Vec sp14;
    Vec sp8;
    float var_f31;

    M456DllMainWork *var_r31;
    s32 var_r29;
    u32 var_r28;
    void *var_r27;
    s32 var_r26;
    OMOBJ **var_r25;
    s32 var_r24;

    var_r31 = var_r30->data;
    var_r29 = var_r31->unk_20;
    var_r28 = var_r31->unk_24;
    if (var_r31->unk_00_field0 == 0) {
        var_r30->trans.y = fn_1_63AC();
    }
    if (fn_1_3B0() < 3) {
        return;
    }
    switch (var_r31->unk_1A) {
        case 0:
            if (fn_1_3B0() == 5) {
                var_r31->unk_00_field2 = 1;
                var_r31->unk_1A = 6;
                return;
            }
            if (fn_1_3B0() == 4) {
                if (var_r31->unk_30 != 0) {
                    var_r31->unk_1A = 1;
                    var_r31->unk_28 = REFRESH_RATE;
                }
                else {
                    var_r31->unk_1A = 6;
                    var_r31->unk_00_field2 = 1;
                }
                return;
            }
            if (GWPlayerCfg[var_r31->unk_02].iscom == 0) {
                var_r31->unk_06 = HuPadStkX[var_r31->unk_04];
                var_r31->unk_07 = HuPadStkY[var_r31->unk_04];
                var_r31->unk_08 = HuPadBtn[var_r31->unk_04];
                var_r31->unk_0A = HuPadBtnDown[var_r31->unk_04] & 0xFFFF9FFF;
            }
            else {
                var_r31->unk_08 = var_r31->unk_0A = 0;
                var_r31->unk_06 = var_r31->unk_07 = 0;
                fn_1_1288(var_r30);
            }
            if (var_r31->unk_2C != 0) {
                if (--var_r31->unk_2C == 0) {
                    var_r29 = 0;
                    var_r28 = 0x40000001;
                }
            }
            if ((var_r31->unk_0A & 0x60) != 0) {
                if (var_r31->unk_0C < 0) {
                    var_r31->unk_0C = (var_r31->unk_0A & 0x40) ? 0 : 1;
                }
                if (((var_r31->unk_0A & lbl_1_data_184[var_r31->unk_0C]) != 0) && ((var_r31->unk_0A & ~lbl_1_data_184[var_r31->unk_0C]) == 0)) {
                    var_r31->unk_30++;
                    var_r31->unk_2C = var_r31->unk_2E;
                    var_r29 = 1;
                    var_r28 = 0x40000001;
                    var_r31->unk_0C ^= 1;
                }
            }
            break;
        case 1:
            if (--var_r31->unk_28 == 0) {
                var_r31->unk_00_field0 = 1;
                var_r31->unk_1A = 2;
                var_r31->unk_28 = var_r31->unk_2A = REFRESH_RATE;
            }
            var_r29 = 2;
            var_r28 = 0;
            break;
        case 2:
            var_r29 = 3;
            var_r28 = 0;
            if (var_r31->unk_28 < (var_r31->unk_2A - 0xF)) {
                var_f31 = (float)var_r31->unk_28 / (var_r31->unk_2A - 0xF);
                var_r30->trans.y = -300.0 * cosd((270.0f * var_f31));
                var_r30->trans.z = 400.0f + (-400.0f * var_f31);
                if ((var_r31->unk_00_field1 == 0) && (var_f31 < 0.35f)) {
                    var_r31->unk_00_field1 = 1;
                    fn_1_67E0(&var_r30->trans, -1.0f);
                    fn_1_61C8(&var_r30->trans, -1.0f, -1.0f, -1);
                    fn_1_7F78();
                    HuAudFXPlay(0x7D2);
                }
            }
            if (--var_r31->unk_28 == 0) {
                var_r30->trans.y = -300.0f;
                var_r30->trans.z = 400.0f;
                var_r31->unk_1A = 3;
                var_r31->unk_28 = (var_r31->unk_30 * REFRESH_RATE) / 5;
                for (var_r26 = 0; var_r26 < lbl_1_bss_64; var_r26++) {
                    if (var_r31->unk_02 == lbl_1_bss_70[var_r26]) {
                        break;
                    }
                }
                if (var_r26 < lbl_1_bss_64) {
                    var_r31->unk_00_field3 = 1;
                    var_r31->unk_28 -= 0.33f*REFRESH_RATE;
                }
                else {
                    var_r31->unk_28 -= 0.8f * REFRESH_RATE;
                }
                var_r31->unk_2A = var_r31->unk_28;
            }
            break;
        case 3:
            var_r29 = 5;
            var_r28 = 0x40000001;
            if (var_r31->unk_28 < 1.0f * REFRESH_RATE) {
                if ((frand() & 3) == 0) {
                    sp14.x = var_r30->trans.x;
                    sp14.y = 100.0f + var_r30->trans.y;
                    sp14.z = var_r30->trans.z;
                    fn_1_74F8(&sp14, -1.0f);
                }
            }
            else if ((frand() & 0xF) == 0) {
                sp14.x = var_r30->trans.x;
                sp14.y = 100.0f + var_r30->trans.y;
                sp14.z = var_r30->trans.z;
                fn_1_74F8(&sp14, -1.0f);
            }
            if (--var_r31->unk_28 == 0) {
                var_r31->unk_00_field1 = 0;
                if (var_r31->unk_00_field3 == 0) {
                    var_r31->unk_1A = 4;
                    var_r31->unk_28 = var_r31->unk_2A = REFRESH_RATE / 1.25;
                }
                else {
                    var_r31->unk_1A = 5;
                    var_r31->unk_28 = var_r31->unk_2A = REFRESH_RATE;
                }
            }
            break;
        case 4:
            var_r29 = 4;
            var_r28 = 0x40000001;
            var_f31 = (float)var_r31->unk_28 / var_r31->unk_2A;
            var_r30->trans.y = -300.0 * sind((90.0f * var_f31));
            if ((frand() & 3) == 0) {
                fn_1_74F8(&var_r30->trans, -1.0f);
            }
            if ((var_r31->unk_00_field1 == 0) && (var_f31 < 0.2f)) {
                var_r31->unk_00_field1 = 1;
                fn_1_67E0(&var_r30->trans, -1.0f);
                fn_1_61C8(&var_r30->trans, -1.0f, -1.0f, -1);
                HuAudFXPlay(0x7D3);
            }
            if (--var_r31->unk_28 == 0) {
                var_r31->unk_00_field2 = 1;
                var_r31->unk_1A = 6;
                var_r30->trans.y = lbl_1_data_164[var_r31->unk_14];
            }
            break;
        case 5:
            var_r29 = 6;
            var_r28 = 0;
            var_f31 = (float)var_r31->unk_28 / var_r31->unk_2A;
            var_r30->trans.y = -300.0 * -sind((270.0f * var_f31));
            if ((var_r31->unk_00_field1 == 0) && (var_f31 < 0.7f)) {
                var_r31->unk_00_field1 = 1;
                fn_1_67E0(&var_r30->trans, 5.0f);
                fn_1_61C8(&var_r30->trans, -1.0f, -1.0f, -1);
                HuAudFXPlay(0x7D3);
                CharFXPlay(var_r31->unk_14, 0x125);
            }
            if (--var_r31->unk_28 == 0) {
                var_r31->unk_00_field2 = 1;
                var_r31->unk_1A = 6;
                var_r30->trans.y = lbl_1_data_164[var_r31->unk_14];
                fn_1_67E0(&var_r30->trans, -1.0f);
                fn_1_61C8(&var_r30->trans, -1.0f, -1.0f, -1);
            }
            break;
        case 6:
            if (var_r31->unk_00_field0 == 0) {
                var_r29 = 0;
            }
            else {
                var_r29 = 5;
            }
            var_r28 = 0x40000001;
            if ((fn_1_3B0() == 5) && (var_r31->unk_00_field3 == 0) && (lbl_1_bss_64 == 1)) {
                var_r25 = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
                VECSubtract(&var_r25[*lbl_1_bss_70]->trans, &var_r30->trans, &sp8);
                var_r30->rot.y = fn_1_2090(var_r30->rot.y, atan2d(sp8.x, sp8.z), 0.1f);
            }
            if (fn_1_3B0() == 0xB) {
                var_r31->unk_1A = 7;
                if (var_r31->unk_00_field3 != 0) {
                    Hu3DMotionOverlaySet(var_r30->mdlId[0], var_r30->mtnId[9]);
                    CharFXPlay(var_r31->unk_14, 0x124);
                }
            }
            break;
        case 7:
            if (var_r31->unk_00_field3 != 0) {
                var_r29 = 5;
                var_r28 = 0x40000001;
                if (73.0f <= Hu3DMotionOverlayTimeGet(var_r30->mdlId[0])) {
                    Hu3DMotionOverlayTimeSet(var_r30->mdlId[0], 35.0f);
                    Hu3DModelAttrReset(var_r30->mdlId[0], HU3D_MOTATTR_OVL_PAUSE);
                }
            }
            else if (var_r31->unk_00_field0 == 0) {
                var_r29 = 8;
                var_r28 = 0;
            }
            break;
    }
    if ((var_r31->unk_00_field0 != 0) && (var_r31->unk_1A >= 6) && (var_r31->unk_1A <= 7) && ((frand() & 0x3F) == 0)) {
        fn_1_61C8(&var_r30->trans, 0.3f, -1.0f, -1);
    }
    if ((var_r29 != var_r31->unk_20) || (var_r28 != var_r31->unk_24)) {
        var_r31->unk_20 = var_r29;
        var_r31->unk_24 = var_r28;
        CharMotionShiftSet(var_r31->unk_14, var_r30->mtnId[var_r31->unk_20], 0.0f, 8.0f, var_r28);
    }
}

void fn_1_2040(OMOBJ *object)
{
    M456DllMainWork *sp8 = object->data;
    if (object->data != NULL) {
        HuMemDirectFree(object->data);
        object->data = NULL;
    }
}

