mariopartyrd/marioparty4/src/REL/m456Dll/main.c
float fn_1_2090(float var_f29, float sp8, float spC)
{
    float var_f31;
    float var_f30;

    var_f31 = fmod(sp8 - var_f29, 360.0);
    if (var_f31 < 0.0f) {
        var_f31 += 360.0f;
    }
    if (var_f31 > 180.0f) {
        var_f31 -= 360.0f;
    }
    var_f30 = fmod(var_f29 + (spC * var_f31), 360.0);
    if (var_f30 < 0.0f) {
        var_f30 += 360.0f;
    }
    return var_f30;
}

void fn_1_2194(HUPROCESS *process)
{
    fn_1_21F8(0, 0, 0.0f);
    lbl_1_bss_8C = omAddObjEx(process, 0xA, 0, 0, -1, fn_1_2448);
}

void fn_1_21F8(s32 arg0, s32 arg1, float arg8)
{
    CZoom = lbl_1_data_0[arg0].unk_00 + (arg8 * (lbl_1_data_0[arg1].unk_00 - lbl_1_data_0[arg0].unk_00));
    Center.x = lbl_1_data_0[arg0].unk_04 + (arg8 * (lbl_1_data_0[arg1].unk_04 - lbl_1_data_0[arg0].unk_04));
    Center.y = lbl_1_data_0[arg0].unk_08 + (arg8 * (lbl_1_data_0[arg1].unk_08 - lbl_1_data_0[arg0].unk_08));
    Center.z = lbl_1_data_0[arg0].unk_0C + (arg8 * (lbl_1_data_0[arg1].unk_0C - lbl_1_data_0[arg0].unk_0C));
    CRot.x = lbl_1_data_0[arg0].unk_10 + (arg8 * (lbl_1_data_0[arg1].unk_10 - lbl_1_data_0[arg0].unk_10));
    CRot.y = lbl_1_data_0[arg0].unk_14 + (arg8 * (lbl_1_data_0[arg1].unk_14 - lbl_1_data_0[arg0].unk_14));
    CRot.z = lbl_1_data_0[arg0].unk_18 + (arg8 * (lbl_1_data_0[arg1].unk_18 - lbl_1_data_0[arg0].unk_18));
}

float lbl_1_data_1A8[2] = { 0.0f, 0.0f };

void fn_1_2448(OMOBJ *object)
{
    HU3DCAMERA *sp8 = Hu3DCamera;

    switch (fn_1_3B0()) {
        case 1:
            fn_1_21F8(0, 1, sind((90.0f * lbl_1_data_1A8[0])));
            if (lbl_1_data_1A8[0] < 1.0f) {
                lbl_1_data_1A8[0] += 1.0f / REFRESH_RATE;
                if (lbl_1_data_1A8[0] > 1.0f) {
                    lbl_1_data_1A8[0] = 1.0f;
                    break;
                }
            }
            break;
        case 4:
        case 5:
        case 6:
        case 7:
            break;
        case 8:
            fn_1_21F8(1, 1, 0.0f);
            break;
        case 9:
            break;
    }
}

M456DllData1B0Struct lbl_1_data_1B0[0x10] = {
    { DATA_MAKE_NUM(DATADIR_M456, 0x44), 0x10E },
    { 0x610037, 0xFA },
    { 0x610030, 0xFA },
    { 0x610030, 0xFA },
    { 0x610030, 0xFA },
    { 0x610030, 0xFA },
    { 0x610030, 0xFA },
    { 0x610030, 0xFA },
    { 0x610030, 0xFA },
    { 0x610031, 0xFA },
    { 0x610031, 0xFA },
    { 0x610031, 0xFA },
    { 0x610031, 0xFA },
    { 0x610031, 0xFA },
    { 0x610031, 0xFA },
    { 0x610031, 0xFA },
};

Vec2f lbl_1_data_230[0x17] = {
    { 0.0f, 0.0f },
    { -52.0f, -9.0f },
    { 53.0f, -8.0f },
    { 35.0f, -8.0f },
    { 9.0f, -8.0f },
    { -9.0f, -8.0f },
    { -31.0f, -8.0f },
    { 23.0f, -8.0f },
    { -17.0f, -8.0f },
    { 53.0f, 8.0f },
    { 35.0f, 8.0f },
    { 9.0f, 8.0f },
    { -9.0f, 8.0f },
    { -31.0f, 8.0f },
    { 23.0f, 8.0f },
    { -17.0f, 8.0f },
    { 355.0f, 0.0f },
    { 0.0f, 0.0f },
    { 275.0f, 128.0f },
    { 950.0f, 6.0f },
    { 0.0f, 0.0f },
    { 0.0f, 190.0f },
    { 0.0f, 550.0f },
};

void fn_1_2918(HUPROCESS *sp8)
{
    M456DllBss18Struct *var_r31;
    s32 var_r30;
    OMOBJ *var_r29;

    var_r29 = omAddObjEx(sp8, 0x7FD9, 0, 0, -1, fn_1_2AC4);
    var_r31 = &lbl_1_bss_18;
    var_r29->data = var_r31;
    memset(var_r31, 0, sizeof(M456DllBss18Struct));
    var_r31->unk_14 = 60 * REFRESH_RATE;
    var_r31->unk_0C = 320.0f;
    var_r31->unk_10 = 64.0f;
    var_r31->unk_1C = 1.0f;
    for (var_r30 = 0; var_r30 < 0x10; var_r30++) {
        var_r31->unk_20[var_r30] = -1;
        if (lbl_1_data_1B0[var_r30].unk_00 != 0) {
            var_r31->unk_20[var_r30] = espEntry(lbl_1_data_1B0[var_r30].unk_00, lbl_1_data_1B0[var_r30].unk_04, 0);
            espAttrSet(var_r31->unk_20[var_r30], HUSPR_ATTR_LINEAR);
            espDispOff(var_r31->unk_20[var_r30]);
        }
    }
    espColorSet(var_r31->unk_20[0], 0, 0, 0);
    espTPLvlSet(var_r31->unk_20[0], 0.699999988079071);
    espBankSet(var_r31->unk_20[7], 0xB);
    espBankSet(var_r31->unk_20[8], 0xA);
    espBankSet(var_r31->unk_20[14], 0xB);
    espBankSet(var_r31->unk_20[15], 0xA);
}

void fn_1_2AC4(OMOBJ *var_r26)
{
    u32 sp8[3];

    M456DllBss18Struct *var_r31;
    s32 var_r30;
    u32 var_r29;
    s32 var_r28;
    s32 var_r27;

    var_r31 = var_r26->data;
    for (var_r30 = 0; var_r30 < 0x10; var_r30++) {
        if (var_r31->unk_20[var_r30] >= 0) {
            if (var_r31->unk_00 == 0) {
                espDispOff(var_r31->unk_20[var_r30]);
            }
            else {
                espDispOn(var_r31->unk_20[var_r30]);
                espPosSet(
                    var_r31->unk_20[var_r30], 0.9f * (var_r31->unk_0C + lbl_1_data_230[var_r30].x), var_r31->unk_10 + lbl_1_data_230[var_r30].y);
            }
        }
    }
    for (var_r30 = 0; var_r30 < 2; var_r30++) {
        if (var_r30 != 0) {
            var_r29 = var_r31->unk_18;
            var_r27 = 9;
        }
        else {
            var_r29 = var_r31->unk_14;
            var_r27 = 2;
        }
        sp8[0] = var_r29 % REFRESH_RATE;
        var_r29 = (var_r29 - sp8[0]) / REFRESH_RATE;
#if VERSION_PAL
        sp8[0] = 100.0f * (sp8[0] / (float)REFRESH_RATE);
#else
        sp8[0] = 100.0f * (1.0f / REFRESH_RATE * sp8[0]);
#endif
        sp8[1] = var_r29 % 60;
        var_r29 = (var_r29 - sp8[1]) / 60;
        sp8[2] = var_r29;
        for (var_r28 = 0; var_r28 < 3; var_r28++) {
            espBankSet(var_r31->unk_20[var_r27++], sp8[var_r28] % 10);
            if (var_r28 < 2) {
                espBankSet(var_r31->unk_20[var_r27++], sp8[var_r28] / 10);
            }
        }
    }
    if (var_r31->unk_04 != 0) {
        if (var_r31->unk_08 == 0) {
            if ((var_r31->unk_1C += 0.02f) >= 1.2f) {
                var_r31->unk_1C = 1.2f;
                var_r31->unk_08 = 1;
            }
        }
        else {
            if ((var_r31->unk_1C -= 0.04f) <= 1.0f) {
                var_r31->unk_1C = 1.0f;
                var_r31->unk_08 = 0;
            }
        }
        for (var_r30 = 1; var_r30 < 9; var_r30++) {
            espScaleSet(var_r31->unk_20[var_r30], var_r31->unk_1C, var_r31->unk_1C);
        }
    }
}
